<template>
  <div class="k-container">
    <section class="k-header">
      <div class="k-header-container">
        <div class="k-logo">LOGO</div>
        <div class="k-menus">
          <ul>
            <li>
              <router-link to="/">首页</router-link>
            </li>
            <li>
              <router-link to="/">文章</router-link>
            </li>
            <li>
              <router-link to="/">关于作者</router-link>
            </li>
          </ul>
        </div>
      </div>
    </section>
    <section class="k-banner">
      <p>krui的一个练手项目</p>
    </section>
    <div class="k-main-container">
      <el-row :gutter="10">
        <el-col :span="18">
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>

            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>

            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>

            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>

            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>

            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-article">
            <div class="k-article-header">
              <div class="k-article-title">
                <h3>文章标题一</h3>
              </div>
              <div class="k-article-tags">
                <ul>
                  <li>标签一</li>
                  <li>标签二</li>
                  <li>标签三</li>
                </ul>
              </div>
              <div class="k-article-info">2018年05月29日 张三 评论 55 条评论 74,209 人阅读</div>
            </div>
            <div class="k-article-main">
              <div class="k-article-brief">
                写极客时间8个月了，我的专栏现在有一定的积累了，今天想自己推荐一下。因为最新的系列《程序员练级攻略（2018）版》正在连载中，而且文章积累量到了我也有比较足的自信向大家推荐我的这个专栏了。推荐就从最新的这一系统的文章开始。
                2011年，我在 CoolShell 上发表了 《程序员技术练级攻略》一文，得到了很多人的好评（转载的不算，在我的网站上都有近1000W的访问量了）。并且陆续收到了一些人的反馈，说跟着这篇文章找到了不错的工作。几年过去，也收到了好些邮件和私信，希望我把这篇文章更新一下，因为他们觉得有点落伍了。是的，老实说，抛开这几年技术的更新迭代不说，那篇文章写得也不算特别系统，同时标准也有点低，当时是给一个想要入门的朋友写的，所以，非常有必要从头更新一下《程序员练级攻略》这一主题。
                目前，我在我极客时间的专栏上更新《程序员练级攻略（2018版）》。升级版的《程序员练级攻略》会比Coolshell上的内容更多，也更专业。这篇文章有【入门篇】、【修养篇】、【专业基础篇】、【软件设计篇】、【高手成长篇】五大篇章，它们会帮助你从零开始，一步步地，系统地，从陌生到熟悉，到理解掌握，从编码到设计再到架构，从码农到程序员再到工程师再到架构师的一步一步进阶，完成从普通到精通到卓越的完美转身……
                这篇文章是我写得最累也是最痛苦的文章，原因如下：
                学习路径的梳理。这是一份计算编程相关知识地图，也是一份成长和学习路径。所以有太多的推敲了，知识的路径，体，地图……这让我费了很多工夫，感觉像在编写一本教材一样，即不能太高大上，也不能误人子弟。
                新旧知识的取舍。另外，因为我的成长经历中很多技术都成了过去时，所以对于新时代的程序员应该学习新的技术，然后，很多基础技术在今天依然管用，所以，在这点上，哪些要那些不要，也花了我很多的工夫。
                文章书籍的推荐。为了推荐最好的学习资料和资源，老实说，我几乎翻遍了整个互联网，进行了大量的阅读和比较。这个过程让我也受益非浅。一开始，这篇文章的大小居然在500K左右，太多的信息就是没有信息，所以在信息的筛选上我花费了很多的工夫，删掉了60%的内容。但是，依然很宠大。
                总之，你一定会被这篇文章的内容所吓到的，是的，我就是故意这样做的，因为，这本来就没有什么捷径，也不可能速成，很多知识都是硬骨头，你只能一口一口的啃，我故意这样做就是为了让你不要有“速成”的幻想，也可以轻而一举的吓退那些不想用功不想努力的人。
                但是，我们也要知道《易经》有云：“取法其上，得乎其中，取法其中，得乎其下，取法其下，法不得也”。所以，我这里会给你立个比较高标准，你要努力达到，相信我，就算是达不到，也会比你一开始期望的要高很多……
                下面是这份练级攻略的目录，目前只在极客时间上发布，你需要付费阅读（在本文最后有相关的二维码）。
                …
                好烂啊有点差凑合看看还不错很精彩 (100 人打了分，平均分： 4.07 )
                关于我”极客时间“的专栏
                关于我”极客时间“的专栏
                2018年01月02日 陈皓 评论 67 条评论 63,037 人阅读
                不少朋友都知道我在“极客时间”上开了一个收费专栏，这个专栏会开设大约一年的时间，一共会发布104篇文章。现在，我在上面以每周两篇文章的频率已发布了27篇文章了，也就是差不多两个半月的时间。新的一年开始了，写专栏这个事对我来说是第一次，在这个过程中有一些感想，所以，我想在这里说一下这些感受和一些相关的故事，算是一个记录，也算是对我专栏的正式介绍，还希望能得到、大家的喜欢和指点。（当然，CoolShell这边还是会持续更新的）
                为什么要开设一个收费专栏
                首先，说一下，为什么要开这个收费专栏。
                老实说，我一开始根本就不想开收费专栏的，是的，完全不想！主要是有两个原因，一方面是我在创业中，我自然是没有太多的时间，另一方面是，我以前在《为什么我不在微信公众号上写文章》也说过，我觉得知识最好的方式是被检索、讨论、引用、整理、补充和更新。所以，收费这种模式，我感觉并不利于很好的传播。但是，我为什么还干了这么一件事？这事还得从2017年6月份开始说起。
                这个月，一共有三家技术社区来找我，都是希望我能去他们那边开收费专栏，其中一家就是“极客邦科技”。对于这三家来说，从一开始我就是以婉拒的姿态回应的。而“极客邦科技”来找我的时候和我说，一周写五篇，写一年，一共260篇。我当时心想，“去你的，当我啥呢，你们真以为技术文章好写啊”？然后，他们问我可以写多少，我说，我现在也就一个月一篇的节奏……
              </div>
              <div class="k-article-more">
                <router-link to="/">阅读全文</router-link>
              </div>
            </div>
            <div class="k-article-footer">阅读评分</div>
          </div>
          <div class="k-pagination">
            <el-pagination
              @size-change="handleSizeChange"
              @current-change="handleCurrentChange"
              :current-page.sync="currentPage3"
              :page-size="100"
              layout="prev, pager, next, jumper"
              :total="1000">
            </el-pagination>
          </div>
        </el-col>
        <el-col :span="6">
          <section class="k-latest-article">
            <div class="k-section-title">
              <h3>
                最新文章
                <span>
                  <a href>更多&gt;&gt;</a>
                </span>
              </h3>
            </div>
            <div class="k-section-list">
              <ul>
                <li>
                  <a href>最新文章一</a>
                </li>
                <li>
                  <a href>最新文章二</a>
                </li>
                <li>
                  <a href>最新文章三</a>
                </li>
                <li>
                  <a href>最新文章四</a>
                </li>
                <li>
                  <a href>最新文章五</a>
                </li>
                <li>
                  <a href>最新文章六</a>
                </li>
                <li>
                  <a href>最新文章七</a>
                </li>
                <li>
                  <a href>最新文章八</a>
                </li>
                <li>
                  <a href>最新文章九</a>
                </li>
                <li>
                  <a href>最新文章十</a>
                </li>
              </ul>
            </div>
          </section>
          <section class="k-tags-group">
            <div class="k-section-title">
              <h3>标签</h3>
            </div>
            <div class="k-section-list">
              <a class="k-tag0" href>标签一</a>
              <a class="k-tag1" href>标签二</a>
              <a class="k-tag2" href>标签三</a>
              <a class="k-tag3" href>标签四</a>
              <a class="k-tag4" href>标签五</a>
              <a class="k-tag5" href>标签六</a>
              <a class="k-tag6" href>标签七</a>
              <a class="k-tag7" href>标签八</a>
              <a class="k-tag8" href>标签九</a>
              <a class="k-tag9" href>标签十</a>
            </div>
          </section>
          <section class="k-features">
            <div class="k-section-title">
              <h3>功能</h3>
            </div>
            <div class="k-section-list">
              <ul>
                <li>
                  <router-link to="/register">注册</router-link>
                </li>
                <li>
                  <router-link to="/login">登陆</router-link>
                </li>
              </ul>
            </div>
          </section>
        </el-col>
      </el-row>
    </div>
    <section class="k-footer">
      <p>dayney.com © 2019 | Powered by Krui | Based on Theme: Nisarg by Falguni Desai.</p>
    </section>
  </div>
</template>

<script>
// import HelloWorld from 'components/HelloWorld.vue'

export default {
  name: 'home',
  components: {
    // HelloWorld
  },
  data () {
    return {
      currentPage3: 5
    }
  },
  created () {
    // this.$store.commit('setToken', 123123)

    console.log(this.$store.state.system.token)
  },
  methods: {
    log () {
      console.log('excel log')
    },
    tagAEvent (e) {
      console.log('excel tagAEvent')
    },
    handleSizeChange (val) {
      console.log(`每页 ${val} 条`)
    },
    handleCurrentChange (val) {
      console.log(`当前页: ${val}`)
    }
  }
}
</script>
<style lang="less">
.k-container {
  @width: 1200px;
  @headerHeight: 50px;
  position: relative;
  width: 100%;
  background-color: #eceff1;
  .k-header,
  .k-banner,
  .k-footer {
    width: 100%;
  }
  .k-main-container {
    width: @width;
    margin: 0 auto;
  }

  .k-header {
    position: fixed;
    top: 0;
    left: 0;
    z-index: 10;
    height: @headerHeight;
    background: #fff;
    .k-header-container {
      width: @width;
      margin: 0 auto;
      .k-logo {
        float: left;
        width: @headerHeight;
        height: @headerHeight;
        background-color: #666;
      }
      .k-menus {
        float: right;
        ul {
          list-style: none;
          li {
            float: left;
            display: block;
            height: @headerHeight;
            padding: 0 10px;
            color: #000;
            font-size: 18px;
            line-height: @headerHeight;
          }
        }
      }
    }
  }
  .k-banner {
    height: 300px;
    margin-top: @headerHeight;
    margin-bottom: 20px;
    background-color: #1d2b2d;
    p {
      height: 300px;
      color: #fff;
      font-size: 36px;
      line-height: 300px;
      text-align: center;
    }
  }

  .k-main-container {
    margin-bottom: 15px;
    .el-row {
      margin-bottom: 20px;
      &:last-child {
        margin-bottom: 0;
      }
    }
    .el-col {
      border-radius: 4px;

      .k-article,
      section {
        margin-bottom: 10px;
        background-color: #fff;
        border-radius: 4px;
        &:last-child {
          margin-bottom: 0;
        }
      }
      .k-article {
        .common-padding {
          padding: 0 15px;
        }
        .k-article-header {
          margin-bottom: 10px;
          border-bottom: 1px solid #dfdfdf;
          .k-article-title h3 {
            @titleHeight: 40px;
            width: 100%;
            height: @titleHeight;
            color: #000;
            font-size: 16px;
            line-height: @titleHeight;
          }
          .k-article-tags,
          .k-article-info {
            .common-padding;
            box-sizing: border-box;
            width: 100%;
            height: 24px;
          }
          .k-article-tags {
            @tagHeight: 24px;
            ul {
              list-style: none;

              li {
                float: left;
                display: block;
                height: @tagHeight;
                padding: 0 5px;
                color: #333;
                font-size: 12px;
                line-height: @tagHeight;
              }
            }
          }
          .k-article-info {
            text-align: left;
          }
        }
        .k-article-main {
          .common-padding;
          box-sizing: border-box;
          .k-article-brief {
            margin-bottom: 10px;
            text-indent: 2em;
          }
          .k-article-more {
            width: 100%;
            text-align: center;
            a {
              @height: 36px;
              height: @height;
              padding: 0 10px;
              line-height: @height;
              border-bottom: 1px solid #ddd;
            }
          }
        }
        .k-article-footer {
          .common-padding;
          box-sizing: border-box;
          width: 100%;
          height: 40px;
          line-height: 40px;
          text-align: left;
        }
      }
      .k-pagination {
        width: 100%;
        background-color: #fff;
      }
      section {
        .k-section-title {
          width: 100%;
          height: 40px;
          line-height: 40px;

          h3 {
            padding: 0 15px;
            color: #000;
            font-size: 16px;
            text-align: left;
            border-bottom: 1px solid #dfdfdf;
            span {
              float: right;
              display: block;
              padding: 0 2px;
              font-size: 12px;
            }
          }
        }
        &.k-latest-article .k-section-list {
          ul {
            list-style: none;
            li {
              @cellHeight: 30px;
              box-sizing: border-box;
              width: 100%;
              height: @cellHeight;
              padding: 0 10px;
              color: #000;
              font-size: 12px;
              line-height: @cellHeight;
              text-align: left;
              border-bottom: 1px dotted #fff;
              &:last-child {
                border-bottom: none;
              }
            }
          }
        }
        &.k-tags-group .k-section-list {
          padding: 10px;
          a {
            display: inline-block;
            padding: 0 4px;
          }
          .k-tag0 {
            color: #000;
            font-size: 14px;
          }
          .k-tag1 {
            color: #615f5f;
            font-size: 16px;
          }
          .k-tag2 {
            color: #727272;
            font-size: 18px;
          }
          .k-tag3 {
            color: #727272;
            font-size: 12px;
          }
          .k-tag4 {
            color: #727272;
            font-size: 14px;
          }
          .k-tag5 {
            color: #727272;
            font-size: 16px;
          }
          .k-tag6 {
            color: #727272;
            font-size: 18px;
          }
          .k-tag7 {
            color: #727272;
            font-size: 14px;
          }
          .k-tag8 {
            color: #78909c;
            font-size: 14px;
          }
          .k-tag9 {
            color: #727272;
            font-size: 18px;
          }
        }
        &.k-features ul {
          padding: 0 15px;
          list-style: none;
          li {
            @height: 30px;
            box-sizing: border-box;
            width: 100%;
            height: @height;
            line-height: @height;
            border-bottom: 1px solid #9ea3ad;
            &:last-child {
              border-bottom: none;
            }
          }
        }
      }
    }
  }
  .k-footer {
    @height: 60px;
    height: @height;
    line-height: @height;
    background-color: #363636;
    p {
      color: #fff;
      text-align: center;
    }
  }
}
</style>
